//?Прокручування до певної позиції
//*Вікно (сторінка)
//*Для прокручування сторінки до певної позиції використовуються методи window.scrollTo() та window.scrollBy().
//* Прокручування до конкретної позиції
//window.scrollTo({
//    top: 500,
//    left: 0,
//    behavior: 'smooth' // 'smooth' для плавного прокручування
//});
//window.scrollTo({
//    top: 500,
//    left: 0,
//    behavior: 'smooth'
//})
//* Прокручування на певну кількість пікселів від поточної позиції
//window.scrollBy({
//    top: 100,
//    left: 0,
//    behavior: 'smooth'
//});
//window.scrollBy({
//    top: 900,
//    left: 0,
//    behavior: 'smooth'
//})
//?Прокручування до елемента
//*Для прокручування до конкретного елемента використовується метод element.scrollIntoView().
//let targetElement = document.getElementById('target');

//* Прокручування до елемента
//targetElement.scrollIntoView({
//    behavior: 'smooth', // Плавне прокручування
//    block: 'start' // Вирівнювання: 'start', 'center', 'end', 'nearest'
//});


//?Плавність прокрутки: Опція behavior: 'smooth' забезпечує плавний перехід. Без цієї опції прокрутка буде миттєвою.
//?Сумісність браузерів: Більшість сучасних браузерів підтримують метод scrollIntoView та його опції, але завжди корисно перевіряти сумісність для старих версій браузерів.
//?Контейнери з прокруткою: Якщо елемент знаходиться всередині контейнера з прокруткою, метод scrollIntoView прокрутить цей контейнер, а не всю сторінку.



//! Завдання 
//? Завершіть плавну прокрутку під час кліку в меню aside