const state = {
    header: [
        { url: 'telegram.svg', text: "Telegram" },
        { url: 'viber.svg', text: "Viber" },
    ],
    aside: [
        { title: 'Види будівництва' },
        { title: 'Наші роботи' },
        { title: 'Відгуки клієнтів' },
        { title: 'Партнери' },
        { title: 'Контакти' },
    ],
    section1: [
        { url: "1.png", text: "Каркасні будинки" },
        { url: "2.png", text: "Будинки з клеєного бруса" },
        { url: "3.png", text: "Будинки з колод" },
        { url: "4.png", text: "Фахверкові будинки" },
        { url: "5.png", text: "Альтанки" },
        { url: "6.png", text: "Ремонт та оздоблення" },
    ],
    section3: [
        { url: "1.svg", title: "Не піднімаємо вартість", text: "Фіксуємо вартість робіт у договорі" },
        { url: "2.svg", title: "Поетапна оплата", text: "Оплата кожного виду робіт розбита на 2 частини (50% аванс 50% по завершенню)" },
        { url: "3.svg", title: "Дотримуємося термінів", text: "Несемо відповідальність за дотримання термінів." },
        { url: "4.svg", title: "Екологічність", text: "Будинок будується з натуральних матеріалів" },
        { url: "5.svg", title: "Самостійно", text: "Закуповуємо та доставляємо на об'єкт, якісні матеріали та розхідники" },
        { url: "6.svg", title: "Проводимо прибирання", text: "У процесі робіт вивозимо сміття після завершення робіт." },
    ],
    section4: [
        { url: "1.png" },
        { url: "2.png" },
        { url: "3.png" },
        { url: "4.png" },
        { url: "5.png" },
        { url: "6.png" },
    ],
    section5: {
        ol: [
            "Вітаю, мене звуть",
            "Прізвище та ім’я.",
            "Я керівник компанії Мій Дім",
        ],
        ul: [
            "Ми не просто надаємо послуги, ми відповідаємо за весь комплекс робіт від проектування до гарантійного обслуговування.",
            "Ви не ризикуєте своїми грошима, нервами та часом. Ми беремо на себе повну матеріальну відповідальність за договором за будинок, роботи, терміни виконання кожного етапу роботи.", "Наша команда прагне повної прозорості в роботі, тому ми із задоволенням показуємо кожен процес будівництва, без прикрас.", "Ми гарантуємо Ваше мінімальне залучення до рутини будівництва, беручи на себе весь комплекс будівельних робіт.", "Ми знаємо все про будівництво дерев'яних будинків та будівельних робіт.", "Проектуємо та будуємо авторські будинки з дерева та клеєного бруса.",
        ]
    },
    section6: [
        { title: "15", text: "років досвіду у будівництві", },
        { title: "15", text: "фахівців у штаті", },
        { title: "53", text: "збудованих будинків", },
    ],
    slider: [
        { url: "sl1.png" },
        { url: "sl2.png" },
        { url: "sl3.png" },
        { url: "sl4.png" },
    ],
    footer: {
        titleFooter: [
            { title: "Наші роботи" },
            { title: "Відгуки клієнтів" },
            { title: "Партнери" },
        ],
        bud: [
            { link: "#", text: "- Каркасні будинки" },
            { link: "#", text: "- Будинки з клеєного бруса" },
            { link: "#", text: "- Фахверкові будинки" },
            { link: "#", text: "- Будинки з колод" },
            { link: "#", text: "- Альтанки" },
            { link: "#", text: "- Ремонт та оздоблення" },
        ],
        contact: [
            { link: "youtube.svg", url: "#" },
            { link: "instagramm.svg", url: "#" },
            { link: "facebook.png", url: "#" },
            
            
        ]
    }

}
exp